app/controllers/homes_controller.rb

INSERT INTO "posts" ("title", "content", "numb", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "제목1"], ["content", "내용1"], ["numb", 1], ["created_at", "2019-06-29 13:50:29.292937"], ["updated_at", "2019-06-29 13:50:29.292937"]]
---
  def second
    one_post = Post.new
    one_post.title = params[:title]
    one_post.content = params[:content]
    one_post.numb = params[:numb]
    one_post.save

SELECT "posts".* FROM "posts"
---
  def read
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "수정제목1"], ["content", "수정내용1"], ["updated_at", "2019-07-01 16:23:39.954030"], ["id", 1]]
---
  def update
    post = Post.find(params[:id])
    post.title = params[:title]
    post.content = params[:content]
    post.numb = params[:numb]
    post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def delete
    # post = Post.find(params[:id])
    # post.destroy
    Post.destroy(params[:id])